---

C#Visual BasicVisual C++

Revit 2024 API
---
ConduitSizes..::..GetEnumerator Method
ConduitSizes Class See Also Send Feedback
---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public virtual IEnumerator<ConduitSize> GetEnumerator()

Visual Basic
---

    Public Overridable Function GetEnumerator As IEnumerator(Of ConduitSize)

Visual C++
---

    public:
    virtual IEnumerator<ConduitSize^>^ GetEnumerator()

#### Return Value

An IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerable<(Of <(<'T>)>)>..::..GetEnumerator()()()()

# See Also

ConduitSizes Class

Autodesk.Revit.DB.Electrical Namespace